GetSubelements Method
 Returns the collection of element subelements.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  Since:  2018
 Syntax
  C#
public IList<Subelement> GetSubelements()
  Visual Basic
Public Function GetSubelements As IList(Of Subelement)
  Visual C++
public:
IList<Subelement^>^ GetSubelements()
 Return Value
 The collection of element subelements.
 Remarks
 This collection will not include the Element itself.
 See Also
  Element Class
  Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →